{"pages":[{"title":"Hello, I&#39;m Lei, a.k.a. Bolicrad.","text":"Developers, developers, developers… Who am I?I’m a game developer. No matter which role I performed in a game project, no matter how I get involved in the game project, no matter whether I code or not in the game project, I’m firstly a game developer. I’m currently pursuing a master’s degree in video game production at the University of Utah’s Entertainment Arts and Engineering. EAE is one of the top video games programs in the world. I create video games with many other talented designers, engineers, and artists here. I got my bachelor’s degree at the University of Science and Technology of China (USTC). USTC is one of the top research-type institutes in China, which directly belongs to the Chinese Academy of Science. The department I graduated from, the Department of Science and Technology Communication, helped me build a solid knowledge system of media research, media production, and media management. I’m 24 years old, male. I was born and grew up in Xi’an, China. This three-thousands-year old capital city provides me with a sensitivity of history, geography, and civilization. I’m always curious about the natural and cultural specifications of every location I nested in and could usually become a master of the time and space structure of the region just as the locals. What do I do in game development? I usually do the design works in collaboration, provide fancy ideas at the pre-production phase of game projects. I also code, both in personal and course projects, ‘cause I believe a live demo is the best documentation to show the gameplay in my mind. I use Machination to simulate and iteration the system design, which helps me build logical systems that players could have fun with. I work on various game engines. Unity, Unreal, Cocos Creator, Monogame, Phaser, etc. Technology would never become a gap between me and fancy gameplays. I even have experience in online-multiplayer games, all coding work done by myself. I’m learning some project management skills and software. To be more agile, I will go snowboarding at the Snowbird Resort this snow season. Sometimes I cooperate with people who aren’t familiar with game creation, such as fine artists, musicians, social workers, or scientists. I utilize my technologies and methodogies of games to help them convey the experiences they wish, to the audience. To Recruiters:I’m look for a Technical Designer / Gameplay Progammer internship in US for summer 2022 I can never find a better term to describe me other than “Technical Designer.” I always feel excited when I find some excellent new tools that might help build innovative gameplays. I’ll always think about: Can I integrate this new tool into my current game projects? Could I find the best candidate to use this tool to create fancy content? Will it enhance the workflow to reduce unnecessary repeating works? If it has some weakness, can I refine it by modifying its source codes? Then I’d take steps to research, implement, apply, and refine those new tools. This cycle could help me in the future in building game creation tools from designer’s need. I feel happy when supporting aowsome game designers and cooperate closely with developers and artists. I understand such position is still not common in the industry, especially for internships, so I’m also developing my design and production skill trees. I also have gameplay programming exerience. If you are looking for a game designer/producer/gameplay programmer intern, I’m still confident to become a candidate. To Artists, Social Workers, and Scientists:I can cooperate with you if: You have fancy interactive ideas but lack an experienced developer to cooperate with; You have a story about vulnerable groups to tell, but worrying about not being able to reach to audience in traditional media; You want to show your science researches or popularize some science concepts to the public, to improve public understanding of science. I have a full skill set to help you create interactive projects, game or non-game, for your purpose. You can call those projects “Serious Games” as you wish, though I don’t really like this term. My undergraduate direction was mass communication for science topics, and I have several practices in such areas. Thank You for ReadingI hope you can learn some slices of me from those words. Please also check my portfolio and resume. Once again, I’m Lei, do not hesitate to contact me if you are interested. Not only for recruiting and cooperation, but you’re also welcome to discuss many topics about or not about games with me. Besides being a game developer and a hardcore gamer, I’m also a hobbyist in the railway system, skiing, urban planning, regional development, geopolitics, urban legends, etc. My Recent FaceTime Screenshot Use Bolicrad to refer me on the Internet; use Lei to contact me in person.","link":"/about/index.html"},{"title":"Portfolio","text":"1. Main Projectsa) ReTrieve.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Role: Gameplay Programmer &amp; Level Designer Period: July 2019 - November 2019 Engine: Unity Specical: Won Tencent 2019 Next Idea Excellence Award (Top 16) This project is a 2D platformer game where players could explore multiple themed worlds, using swords and elementary magics to fight against various bosses. I worked on this title for about 4 months with a team of 5, including another programmer and 3 artists. I mainly focused on the design and programming work of enemy AI and Boss Fights. I also instructed the artist team to create the tilemap, designed the level blocks in the 3.0 version, and coded for the level random generating algorithms. ReTrieve by MCATIN, 419152731, Bolicrad, Daemonn See more details in this Dev Story post. b) Project Haiku .embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Role: Game Designer &amp; Programmer Period: October 2020 - December 2020; April 2021 - May 2021 Engine: Cocos Creator, Agora, WebAudio Special: First performed at Beijing 798 Art Zone. Sponsored by Goethe Institute Beijing. This project is an interactive music performance experience. I cooperated with musician and artist Clore Cai and tried to provide a space for the audience to contribute to the sound field through their new organ: the smartphone. I used Cocos Creator to create a juicy user interface based on Html5. I utilized WebAudio to make it possible for the players to generate and modify the music from their smartphones. I also programmed for the client-master communication features using the chatroom framework by Agora to help musicians and VJ to adjust their theme according to the audience’s state and the whole sound field. Try the live demo on gitee.ioc) Vacuum War Role: Technical Designer &amp; Hardware Engineer Period: Janurary 2022 - Present Engine: Unity (Oculous VR); Arduino for hardwares. Special: EAE Project I course project (semster-long; Alt Control) This ongoing project is a currently a coursework under the topic of “Alternative Controllers”. The Idea comes from the switchable heads of cleaning vacuums. Main Gameplay is that you use physical vacuum gun and shoot in the VR space, with sometimes sucking ammos with another head. I majorly work on the hardware part, about the head detection, wireless communication, and glue codes on the game side. A team of 12 would make efforts on this game in the upcoming months, more heads types, more slots, more mechnics would show up soon. More details going be updated as the project progresses.d) Bouncy Strike Role: Gameplay Programmer Period: December 2020 - April 2021 Engine: Cocos Creator This game was the main project when I worked at Tantrum Network. I took all programming works of this game from scratch, including the main gameplay, data structure of heroes and enemies, UI framework, animation pipeline, data automation, etc. The IP owner later polished and published it on iOS, the UI system updated, but the core gameplay and animation systems retains as when I left this project. e) Everyday Dice Game Role: Gameplay Programmer Period: Feburary 2020 - May 2020 Engine: Cocos Creator This game is a contract work from an individual who wanted to bring the experience of rolling dice with friends from the bar to virtual, as the covid breakout made it impossible to gather together in the bar. I systematically learned the rule of the desired dice game, then made it digital with my artist cooperator Chuxian Wang. The core engineer problem is online communication: Finally, I discovered a new cloud framework provided by WeChat, with which I could create sessions for the online play without any server-end codes. Try the live demo in Wechat by scanning this QR code (Chinese version only) 2. Tech Demosa) Route of Industilization Role: Solo Developer Period: One week in Janurary 2022 Engine: Unity This tech demo is a cousework of the “Experimental Gameplay” Course. I tried to develop a jump system in a 2d platformer setting. I made this majorly because I want to learn the creation of a 2d platformer character, including coding, as well as the animator state machine and the animations by frame. Character part in the ReTrieve project is mainly developed by my friend Daemon Pan, so I still want to discover my potential to finish such a game by myself. The double jump mechanic is well profiled and please have a try. Route of Industrialization by Bolicradar b) True Fisrt Person Demo in Unreal Role: Solo Developer Period: Feburay 8th 2022 Engine: Unreal This tech demo is a cousework of the “Experimental Gameplay” Course. The theme “Melodramtic” inspired me to create an experience that players are in true first person vision, to take a shower and cleaning body. Alothough the gameplay was not made in any speaking, at least I tried to made the camera binded to the head of the avatars’ skeleton, and created the control of the avatar’s neck and head with mouse, seperate with the control of movement. I majorly referenced this article, using aim offset system in unreal, but also profiled the function and removed the necessity of C++ codes. It works perfectly with just Blueprint. The potential of this system in gameplay is to enhance the sense of existence of yourself in the world, but also have distinct experience with normal FPS and VR games. In multiplayer games, players can see each others neck move fluently, which is absolutely a novel experience. Updated playables will be posted here after final debug &amp; build.c) Interactive Comic Framework Role: Solo Developer Period: One week in Janurary 2021 Engine: Cocos Creator This tech demo is a part of my work result at Tantrum Network. Liangzhu was an interactive comic originated from an artist’s student-era project made with Unity, and this start-up company wanted to port this project to a platform only support web-version game files. I then researched and developed the warping codes to directly import the psd files with certain layer hierarchy into cocos creator’s object hierarchy, and transform them into working interactable comic automaticly. Based on the Baum.js Photoshop plugin and Baum2CocosCreator library. Also added motion frames and interactable choices. Try the live demo on gitee.iod) Inky_Stone Role: Solo Developer Period: Two weeks in November 2019 Engine: Cocos Creator This tech demo is a part of my work result in Dr.Stone Popular Science Studio. The students in earth and space science intended to make some physics-based minigames by themselves with cocos creator, and wanted to add a framework to for science-themed interactive dialouges. So I imported the ink.js library to the cocos proejct, and made a tech demo to excute the file exported from the inky editor, to empower the game team to create fun choices and questions. Inky_Stone by Bolicradar 3. Prototypes &amp; Minor Projectsa) Heist-N-Heat Infinite Role: Techinal UI Designer &amp; Producer Period: November 2021 - December 2021 Engine: Unreal (UMG/Blueprint) Special: My final project in the MEAE Rapid Prototype Course. This project is an race game that players drives a crazy car in the cit collecting treasure and fuel, avoiding the cop’s chase. The highlight is that we have the twitch integration that twitch watcher could use command to produce obstacle or boosters for the player when streaming. I joined the project in the mid-phase and took over the UI function remake, 2D/UI art asset management, as well as technology research works on twitch API. Heist N' Heat: Infinite by Foursay b) Stinky Snake Role: Solo Game Developer Period: Februray 1st 2022 Engine: Unity Special: EXTREMELY STINKY. You will like it. A work of my SP22 EAE course “Experimental Gameplay”. This title rethinks the relationship between we human and the influence we made to the environment, and tried to explore what potential effects the “eternal legacy” would provide to us, in an irony way. Developed in exactly one day and have just art/audio assets outsourced. Stinky Snake by Bolicradar c) Tele-Rang Role: Technical Designer and Gameplay Programmer Period: 2 Weeks, August 2021- September 2021 Engine: Monogame Special: First Prototype in EAE Rapid Prototype Course, Ranked Top 3 in peer voting. This prototype was required to design around a toy boomerang (toy varies among teams). I researched the engines that was allowed and made decision for the team to use Monogame. I explored and inplemented the Monogame.Extended library to the project files, and helped the programmer to finish many features such as animation state machine, movement algorithm, game cycle logics. I also helped producer in pitching for operating the live demo because I was the only one in the team who could pass the hard level. Check project files on Google Drived) Trick.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Role: Game Designer &amp; Gameplay programmer Period: a Week in Janurary 2019 Engine: Unity Special: My first game prototype cooperated with experienced teammates. This prototype is my fisrt piece of work in video game, cooperated with two other experienced programmers and three student artists. For design, I brought up the idea of asymmetric local multiplayer, that one player control the hero with keyboard and the other control the demon king with mouse to trigger the traps. For engineering, I focused on the algorithm of the traps’ movement and enemies’ logic (especially the creppy flies). I also finished half of the level design, by creating level prefab with the object brush provided by my teammate. Trick by Bolicrad, MKK.kkkk, hch12hhh, BloodyOrchidDC, Hikari cat e) Trash Truck Role: Solo Game Developer Period: March-May 2019 Engine: Unity Special: Serious Game, won my undergraduate university’s Energy Saving creation award. This is a serious game themed on trash categorizing and recycling, intended to educate kids to learn how to throw the trash into correct kind of trashcan to help the socitey to deal with recycling better. Created with Unity Playground. Trash Truck by Bolicrad f) Grassland Guardian Role: Solo Game Developer Period: Originated in May 2019, developed from December 2019 to June 2020 Engine: Unity (Original Prototype) &amp; Cocos Creator (Publish Version) Special: Serious Game connected with my thesis project for bachelor’s degree This game originated in a hackathon intended to help an NGO enhance its public communication. The NGO has worked on grassland protection and fought against desertification for several years in Northeastern China. I brought up a serious game plan to show their difficulty and finished a prototype within 24 hours. Later, I remade this project into an applet-based game and completed my thesis based on this game’s development process and communication effect research. Grassland Guardian by Bolicradar","link":"/portfolio/index.html"},{"title":"Resume","text":"","link":"/resume/index.html"}],"posts":[{"title":"How to Use an iPad as the Only Display of Mac Mini","text":"We all know that Apple provided a feature called Sidecar. In the recent macOs Monterey, the the pane ‘Sidecar’ disappeared from System Preference App. Actually this feature is still availble through the pane “Display”. This article is not to instruct you how to open the sidercar step by step, but to provide a new stable way to automatically open it every time when you open your mac, then for mac mini users who only want to display mac on iPads, your dream could come true. Stop buzzling, show me the code!AutoSidecar12345678910111213141516171819tell application &quot;System Preferences&quot; activate delay 0.5 set the current pane to pane id &quot;com.apple.preference.displays&quot; beep 1 delay 2 tell application &quot;System Events&quot; tell process &quot;System Preferences&quot; tell first window tell first pop up button click click menu item &quot;name_of_the_iPad&quot; of menu 1 -- replace &quot;name_of_the_iPad&quot; into your iPad name end tell end tell end tell end tell quitend tell","link":"/post/MacMiniAutoSidecar/"},{"title":"Retrieve Dev Story","text":"This game was originated in a 7-day game dev camp in late July 2019. I can still remember that summer when I was still a curious, passionate, and enthusiastic rookie game developer, full of creativity. I didn’t have much experience in game programming at that time. But actually, that’s why I dare to take the role of “Programmer” of a game dev camp: not realizing how hard it is to become a real game engineer in the industry. Ver. 0.1: Born from a wishMy teammates are mainly hardcore gamers. We admired our game experience in childhood, missed the feeling of taking an adventure in the delicate pixel worlds, and wished to bring such sense to modern gamers. That’s the motivation for our first design decision: making a 2D pixel-styled platformer adventure game. During the week, I was focused on coding for the camera following mechanic (later solved by Unity plugin Cinemachine), implementing controller input frameworks, learning how to code for the bosses’ AI (with handwritten state machine), and preparing slides for pitching in the midnight before the due. It was the first time I felt like I was burned out in game development. Unfortunately, developing a platformer game is not as simple as playing Super Mario Bros. Our product after the week was not so ideal that I once believed it was the final form. The team should separate and keep walking on each one’s path. For a summer session, I took a flight from Beijing to Shanghai, then to Irvine, California. But before we went, my friend Daemon Pan and I decided to submit it to the Tencent Competition. This decision finally gave our project a possibility to be retrieved. Ver. 0.2: Rush, Game Developers!When it was near the end of my summer school in UCI, A good news came out to me: Retrieve, the demo we submitted to Tencent, passed the first round filtering and entered the second round competition. I canceled all my previous schedules after flying back to China. Then in late August, the second day after I went back to China, I immediately rushed to Hangzhou, where we decided to gather again. This round we reconstructed the whole project: Art: Our artists’ productivity cannot support keeping the pre-painted level arts, so we shifted into Tiled Map. I integrated the unity 2d tilemap expansion into our project, then learned the rules of how tilemap distributes, instructed the art team to develop our first set of tiles. Design: I decided to utilize a Zelda approach to design the whole level structure of the game. We set 3 different themed sub-worlds. Each has a boss at the end of the level. After collecting three gems from 3 worlds, the secret portal to the final boss would open in the central room. Code: My handwritten state machine is not stable enough for AIs, and it was frustrating when I wanted to create some cross-frame logic. Thus a replaced the AI framework into a coroutine-based system, inspired by a blog from Jean Simonet. I then made 9 different kinds of regular enemies AI under the new framework and reconstructed all the 5 bosses’ AI. The efficiency was totally different. The development strength was extreme in this phase: Our work hour was usually extended to 3-4 am, with no rest on weekends. I celebrated my 22nd birthday in the hotel and turned back into development after finishing the cake. The word label on the corner of the cake said: “Wish you can win a reward!”. Such kind of work style made 2 of our artists exit the project after this phase. Later in the middle of September, Daemon and I finished the second version of Retrieve on the attic of his home. Ver. 0.3: From a demo into a game5 days before October 2019, we were informed that we entered the third round of the competition, which means no more than 15 other teams are competing with us. Meanwhile, we could foresee that this would probably be our last version because other teams were hardworking, and we weren’t the most talented or experienced. This situation led us to one last design decision: Make it a game with complete structure, user interface, and storytelling elements. We gathered in Hangzhou again before October 1, 2019, which should have been a week-long holiday. Luckily, a new artist Chuxian joined us and helped us reproduce 4 sets of more exquisite tiles. In this phase, I have done the following works: Art: I again instructed the new artist about creating a tiled map, such as determining which side of the block should be continuous and which side should be unique. Under this rule, we even rebuilt the moving platform assets and evolved our art style from 8-bit into 16 bit. Design: In this cycle, I decided to add some Roguelike elements to the levels before the boss room: We don’t want to make it Cuphead-like. I designed several “level Chunks” and randomly combined those prefabs into a whole level. That inherits the idea of how Spelunky generates its level. Code: I coded for the level generate system mentioned before and worked on the cutscene manga system, which gives this game a narrative—the rest of the time to debug or work on minor systems. As we predicted, the game was not able to enter the top 6. But Later, we were still be issued an excellence award, the proof of the Top 16 of this year. Because we all had to start preparing the application for the master’s program in November, the development was stopped. I was so proud of the product we created and appreciated everyone who devoted to this project. Finally, we had a game like this:.embed-container { position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%; } .embed-container iframe, .embed-container object, .embed-container embed { position: absolute; top: 0; left: 0; width: 100%; height: 100%; } Postmorterm from 2021I recently downloaded it from itch.io, to play the game again and write something for this new portfolio site. I found some obvious weakness, form both player and developer’s perspective: 1. The jumping action was poor designed.I cannot remember clearly how this fuction was crafted, but jumping in this game is not powerful, but sometimes frustrating. We have many platforms that the player need to use double jump, but actually the character itself cannot jump twice after once performed wall-jump. It is a bug in design that we did not provide such affordance, but most players have this instinct from their experience in SMB or Celeste. We should have consider this and do some special coding in profile. 2. The Level-size/player-size ratio was too small.The level chunks I created in the 0.3 version was not well tested. Some paths are only 3-block high, but our character have 2 block size. Considering better user experience, we should have made the level scale at least twice larger. The path from the start to the end of a paticular level was too long, either. The level generating principle was still cool, but specific data settings should be reconsidered. 3. The sword attack was weakened too much.At the time we made the decision to make combining 4 elements into 10 magics, we were thinking about making this new feature the main way to defeat most enemies. But according to my recent test, this change made it impossible for regular-leveled players to beat up the bosses. We need to reconsider the system balancing. 4. The Tiled Map has tiny seams among each block.Minor tech error on rendering, but must have some way to solve. To conclude, I have to say, as my fisrt completed game project, though Retrieve has a lot of design defects and engineering problems, it’s still means a lot to me, and have the potential to be refined, or remastered in the future.Download from itch.io","link":"/post/Retrieve/"}],"tags":[{"name":"Game","slug":"Game","link":"/tags/Game/"},{"name":"Tech","slug":"Tech","link":"/tags/Tech/"},{"name":"macOS","slug":"macOS","link":"/tags/macOS/"}],"categories":[{"name":"Portfolio","slug":"Portfolio","link":"/categories/Portfolio/"}]}